<?php

/*
|--------------------------------------------------------------------------
| 定时任务配置文件
|--------------------------------------------------------------------------
| 定义执行的定时任务，当定时任务驱动对象为 Job 时有效
|
*/
return [
    [
        // 任务名称
        'title'     => '测试对象方法任务',
        // 任务类型, 0执行对象方法
        'type'      => 0,
        // 定时执行规则
        'rule'      => '0/10 * * * * *',
        // 任务执行目标对象, 使用 @ 定义方法名，默认方法名 handler
        'target'    => \app\crontab\DemoTask::class,
        // 目标对象参数
        'params'    => [],
        // 是否单次执行
        'singleton' => 0,
        // 是否有效
        'status'    => 1,
    ],
    [
        // 任务名称
        'title'     => '测试HTTP请求任务',
        // 任务类型，1执行HTTP请求
        'type'      => 1,
        // 定时执行规则
        'rule'      => '5 0 * * * *',
        // 任务执行目标对象
        'target'    => 'https://gdmon.com/',
        // 目标对象参数
        'params'    => [
            // 请求方式
            'method'    => 'GET',
            // 请求头
            'header'    => [],
            // 请求数据
            'data'      => [['name' => 't', 'type' => 'text', 'value' => 'test']],
        ],
        // 是否单次执行
        'singleton' => 1,
        // 是否有效
        'status'    => 1,
    ]
];
